stm32-hotspot/stm32h7-matter-bridge/Projects/NUCLEO-H753ZI/Applications/Matter/Bridge-App/Inc/STM32CHIPConfig.h

/* This file will move in [App]/Inc and will be generated by CubeMX probably !*/

#define STM32_CHIP_TASK_STACK_SIZE 49152
#define STM32_CHIP_TASK_PRIORITY 2
#define STM32_MAX_EVENT_QUEUE_SIZE 100

#define STM32_DEVICE_VENDOR_ID 0xFFF1
#define STM32_DEVICE_PRODUCT_ID 0x8001
#define STM32_DEVICE_TYPE 0x0101 //257 //Dimmable Bulb

#define STM32_DEFAULT_DEVICE_HARDWARE_VERSION 0
#define STM32_DEVICE_SOFTWARE_VERSION "x.x"
#define STM32_DEVICE_SOFTWARE_VERSION_NUMBER 0

		/* Wi-Fi */
#define STM32_WIFI_STATION_RECONNECT_INTERVAL 5000
#define STM32_MAX_SCAN_NETWORKS_RESULTS 10
#define STM32_WIFI_SCAN_COMPLETION_TIMEOUT 10000
#define STM32_WIFI_CONNECTIVITY_TIMEOUT 30000
#define STM32_WIFI_AP_SSID_PREFIX "MATTER-"
#define STM32_WIFI_AP_CHANNEL 1
#define STM32_WIFI_AP_MAX_STATIONS 4
#define STM32_WIFI_AP_BEACON_INTERVAL 100
#define STM32_WIFI_AP_IDLE_TIMEOUT 120000
#define STM32_ENABLE_WIFI_TELEMETRY 0

		/* BLE Commissioning and divers */
#define STM32_ENABLE_CHIPOBLE 0
#define STM32_ENABLE_EXTENDED_DISCOVERY 0
#define STM32_ENABLE_COMMISSIONABLE_DEVICE_TYPE 0
#define STM32_BLE_DEVICE_NAME_PREFIX "MATTER-"
#define STM32_BLE_FAST_ADVERTISING_INTERVAL_MIN 32
#define STM32_BLE_FAST_ADVERTISING_INTERVAL_MAX 96
#define STM32_BLE_SLOW_ADVERTISING_INTERVAL_MIN 240
#define STM32_BLE_SLOW_ADVERTISING_INTERVAL_MAX 1920
#define STM32_CHIPOBLE_SINGLE_CONNECTION 1
#define STM32_CHIPOBLE_DISABLE_ADVERTISING_WHEN_PROVISIONED 0
#define STM32_ENABLE_CHIP_TIME_SERVICE_TIME_SYNC 0
#define STM32_CHIP_TIME_SERVICE_ENDPOINT_ID 0x18B4300200000005ULL
#define STM32_DEFAULT_TIME_SYNC_INTERVAL 180
#define STM32_TIME_SYNC_TIMEOUT 10000
#define STM32_SERVICE_PROVISIONING_ENDPOINT_ID 0x18B4300200000010ULL
#define STM32_SERVICE_PROVISIONING_CONNECTIVITY_TIMEOUT 10000
#define STM32_SERVICE_PROVISIONING_REQUEST_TIMEOUT 10000
#define STM32_ENABLE_TEST_SETUP_PARAMS 1	//WARNING :  SHOULD NEVER BE ENABLED IN PRODUCTION BUILDS
#define STM32_USE_TEST_SERIAL_NUMBER "TEST_SN"
#define STM32_ENABLE_TRAIT_MANAGER 0
#define STM32_ENABLE_THREAD_TELEMETRY 0
#define STM32_ENABLE_THREAD_TELEMETRY_FULL 0
#define STM32_EVENT_LOGGING_CRIT_BUFFER_SIZE 4096
#define STM32_EVENT_LOGGING_PROD_BUFFER_SIZE 2048
#define STM32_EVENT_LOGGING_INFO_BUFFER_SIZE 1024
#define STM32_EVENT_LOGGING_DEBUG_BUFFER_SIZE 1024
#define STM32_LOG_PROVISIONING_HASH 1
#define STM32_CHIP_FACTORY_NAMESPACE_PARTITION_LABEL "nvs"
#define STM32_CHIP_CONFIG_NAMESPACE_PARTITION_LABEL "nvs"
#define STM32_CHIP_COUNTERS_NAMESPACE_PARTITION_LABEL "nvs"
#define ENABLE_STM32_DEVICE_INSTANCE_INFO_PROVIDER 0

#define STM32STORE_MAX_KEY_SIZE 30

#define STM32_RENDEZVOUS_MODE 8

//CHIPPlatformConfig.h
#define STM32_SECURITY_TEST_MODE 0
#define STM32_DEBUG_CERT_VALIDATION 0
